SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
    uint32_t img_offset = first_chunk;
    uint32_t batch_blk  = 1;
    while (img_offset < img_size && batch_blk < batch_blocks) {
        uint32_t chunk = SD_BLOCK_SIZE;
        if (chunk > img_size - img_offset) chunk = img_size - img_offset;
        memcpy(sd_batch_buf + batch_blk * SD_BLOCK_SIZE, img_buf + img_offset, chunk);
        if (chunk < SD_BLOCK_SIZE)
            memset(sd_batch_buf + batch_blk * SD_BLOCK_SIZE + chunk, 0, SD_BLOCK_SIZE - chunk);
        img_offset += chunk;
        batch_blk++;
    }

    PERF_MARK(g_perf_timer, CACHE_CLEAN);
    SCB_CleanDCache_by_Addr((uint32_t *)sd_batch_buf, batch_blk * SD_BLOCK_SIZE);
    PERF_MARK(g_perf_timer, SD_WRITE);

    uint32_t t0 = HAL_GetTick();
    HAL_StatusTypeDef st = HAL_SD_WriteBlocks(&hsd1, sd_batch_buf, base, batch_blk, HAL_MAX_DELAY);
    uint32_t write_ms = HAL_GetTick() - t0;

    Perf_SD_RecordBatch(&g_perf_timer, wait_ms, write_ms, 0, st == HAL_OK ? batch_blk : 0);
    if (st != HAL_OK) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] header FAIL block %lu HAL=0x%08lX STA=0x%08lX\n",
               (unsigned long)base, (unsigned long)st, (unsigned long)SDMMC2->STA);
#endif
        return -1;
    }

    local_batch_count++;
    uint32_t current_block = base + batch_blk;

    while (img_offset < img_size) {
        uint32_t remaining_bytes = img_size - img_offset;
        uint32_t remaining_blocks_full = (remaining_bytes + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
        uint32_t blocks_in_batch = (remaining_blocks_full < batch_blocks) ? remaining_blocks_full : batch_blocks;

        for (uint32_t b = 0; b < blocks_in_batch; b++) {
            uint32_t src = img_offset + b * SD_BLOCK_SIZE;
            uint32_t dst = b * SD_BLOCK_SIZE;
            if (src + SD_BLOCK_SIZE <= img_size) {
                memcpy(sd_batch_buf + dst, img_buf + src, SD_BLOCK_SIZE);
            } else {
                uint32_t partial = img_size - src;
                memcpy(sd_batch_buf + dst, img_buf + src, partial);
                memset(sd_batch_buf + dst + partial, 0, SD_BLOCK_SIZE - partial);
            }
        }

        SCB_CleanDCache_by_Addr((uint32_t *)sd_batch_buf, blocks_in_batch * SD_BLOCK_SIZE);

        /* HYBRID WAIT (adaptive + minimum gap):
           1. Poll HAL_SD_GetCardState until the card reports TRANSFER ready
              (may take 0-5000ms depending on card speed and internal flash state)
           2. THEN wait 20ms for the card's internal NAND flash erase/program
              cycles to complete. The CMD13 "ready" status is optimistic — the
              card's host controller reports ready before the NAND flash is
              actually done. Without this gap, STA=0x5000 (Data CRC timeout)
              occurs on many SDXC cards when the next write arrives too early.
           This combination: adaptive wait handles slow cards, fixed gap handles
           the CMD13-vs-NAND timing mismatch that causes CRC errors. */
        t0 = HAL_GetTick();
        if (SD_WaitForReady() != 0) {
#if PERF_DEBUG_LEVEL >= 1
            printf("[SD] timeout before block %lu\n", (unsigned long)current_block);
#endif
            return -1;
        }
        wait_ms = HAL_GetTick() - t0;

        /* Minimum inter-batch recovery gap (configurable via SD_BATCH_RECOVERY_GAP_MS in app_config.h) */
        t0 = HAL_GetTick();
        vTaskDelay(pdMS_TO_TICKS(SD_BATCH_RECOVERY_GAP_MS));
        uint32_t gap_ms = HAL_GetTick() - t0;

        t0 = HAL_GetTick();
        st = HAL_SD_WriteBlocks(&hsd1, sd_batch_buf, current_block, blocks_in_batch, HAL_MAX_DELAY);
        write_ms = HAL_GetTick() - t0;

        Perf_SD_RecordBatch(&g_perf_timer, wait_ms, write_ms, gap_ms, st == HAL_OK ? blocks_in_batch : 0);
        if (st != HAL_OK) {
#if PERF_DEBUG_LEVEL >= 1
            printf("[SD] FAIL block %lu HAL=0x%08lX STA=0x%08lX\n",
                   (unsigned long)current_block, (unsigned long)st, (unsigned long)SDMMC2->STA);
#endif
            return -1;
        }

        local_batch_count++;
#if PERF_DEBUG_LEVEL >= 2
        if (PERF_SD_BATCH_PRINT_EVERY > 0 && (local_batch_count % PERF_SD_BATCH_PRINT_EVERY) == 0) {
            uint32_t done_bytes = img_offset + blocks_in_batch * SD_BLOCK_SIZE;
            float pct = (100.0f * done_bytes) / img_size;
            printf("[SD] #%lu wait=%lums write=%lums gap=%lums | %.1f%%\n",
               (unsigned long)local_batch_count, (unsigned long)wait_ms, (unsigned long)write_ms, (unsigned long)gap_ms, pct);
        }
#elif PERF_DEBUG_LEVEL >= 1
        if ((local_batch_count % 64) == 0) {
            uint32_t done_bytes = img_offset + blocks_in_batch * SD_BLOCK_SIZE;
            float pct = (100.0f * done_bytes) / img_size;
            printf("[SD] ... %.1f%%\n", pct);
        }
#endif
        img_offset += blocks_in_batch * SD_BLOCK_SIZE;
        current_block += blocks_in_batch;
    }

    g_sd_img_base_block = current_block;
    /* Cycle completion belongs to Capture_RequestSnapshot, after all frames. */
#if PERF_DEBUG_LEVEL >= 1
    printf("[SD] OK blocks %lu..%lu (%lu batches)\n",
           (unsigned long)base, (unsigned long)(current_block - 1), (unsigned long)local_batch_count);
#endif
    return 0;
}

/* ==================== SENSOR TASK ==================== */
void sensor_task(void *arg)
{
    (void)arg;
    extern volatile int system_ready;
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

    if (VL53L5CX_Init(&hi2c1) != 0) {
        g_sensor_state = SENSOR_STATE_STOPPED;
        while (1) vTaskDelay(pdMS_TO_TICKS(1000));
    }

#if VL53L5CX_DET_RESOLUTION == 8
    VL53L5CX_Configure(VL53L5CX_RESOLUTION_8X8, VL53L5CX_DET_INTEGRATION_MS, VL53L5CX_DET_RANGING_FREQ_HZ);
#else
    VL53L5CX_Configure(VL53L5CX_RESOLUTION_4X4, VL53L5CX_DET_INTEGRATION_MS, VL53L5CX_DET_RANGING_FREQ_HZ);
#endif

    VL53L5CX_StartRanging();

#if VL53L5CX_DUAL_SENSOR
    /* Initialize external (guardian) sensor */
    if (VL53L5CX_External_Init() != 0) {
        printf("[WARN] External ToF init failed, continuing with primary only\n");
    } else {
        VL53L5CX_External_Configure();
        VL53L5CX_External_StartRanging();
    }
#endif

    /* Learn primary sensor baseline (sensor is active from StartRanging above) */
    VL53L5CX_LearnBaseline();

#if VL53L5CX_DUAL_SENSOR
    /* Learn external sensor baseline */
    if (VL53L5CX_External_GetState() != EXTERNAL_STATE_IDLE) {
        VL53L5CX_External_LearnBaseline();
    }

    /* NOW put primary sensor to sleep (both baselines are learned).
       Use the startup variant: plain Primary_Sleep() is a no-op here because
       the state machine still holds its initial SLEEP value while the sensor
       is physically ranging. */
    VL53L5CX_Primary_SleepAtStartup();

